# Assignment 2 - Data Preprocessing
### Ahsan Shakoor


- Deadline: Thursday, 20.11.2024
- Data Source: https://www.kaggle.com/datasets/jacopoferretti/wages-and-education-of-young-males-dataset/data


In this assignment, you will preprocess and clean a dataset by handling missing values, correcting inconsistencies, normalizing or encoding features, and removing outliers to prepare it for analysis or modeling. The expected result is a clean, structured dataset ready for further analysis or machine learning._

In [20]:
import pandas as pd  
from sklearn.preprocessing import OneHotEncoder

In [21]:
df = pd.read_csv(r'Males.csv')

In [22]:
df.sample(5)

,rownames,nr,year,school,exper,union,ethn,maried,health,wage,industry,occupation,residence
4131,4132,11890,1983,6,13,no,hisp,yes,no,1.425713,Trade,Service_Workers,NaN
2403,2404,5147,1983,12,7,yes,hisp,yes,no,2.053914,Transportation,Operatives_and_kindred,NaN
1885,1886,3777,1985,12,7,yes,other,yes,no,2.094466,Trade,"Managers, Officials_and_Proprietors",nothern_central
2976,2977,7424,1980,11,1,no,hisp,no,no,1.289395,Trade,Laborers_and_farmers,south
3557,3558,9066,1985,11,6,no,black,no,no,1.415847,Personal_Service,Service_Workers,south

In [23]:
df.isnull().sum()

rownames         0
nr               0
year             0
school           0
exper            0
union            0
ethn             0
maried           0
health           0
wage             0
industry         0
occupation       0
residence     1245
dtype: int64

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4360 entries, 0 to 4359
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rownames    4360 non-null   int64
 1   nr          4360 non-null   int64
 2   year        4360 non-null   int64
 3   school      4360 non-null   int64
 4   exper       4360 non-null   int64
 5   union       4360 non-null   object
 6   ethn        4360 non-null   object
 7   maried      4360 non-null   object
 8   health      4360 non-null   object
 9   wage        4360 non-null   float64
 10  industry    4360 non-null   object
 11  occupation  4360 non-null   object
 12  residence   3115 non-null   object
dtypes: float64(1), int64(5), object(7)
memory usage: 442.9+ KB

In [25]:
df[['union', 'ethn', 'maried', 'health', 'industry', 'occupation', 'residence']].nunique()

union          2
ethn           3
maried         2
health         2
industry      12
occupation     9
residence      4
dtype: int64

In [26]:
print(df['union'].value_counts())
df['ethn'].value_counts()

union
no     3296
yes    1064
Name: count, dtype: int64

ethn
other    3176
hisp      680
black     504
Name: count, dtype: int64

In [27]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd

# Define the columns to encode
columns_to_encode = ['union', 'ethn', 'maried', 'health', 'industry', 'occupation']

# Initialize the LabelEncoder
label_encoders = {col: LabelEncoder() for col in columns_to_encode}

# Apply label encoding to each column
for col in columns_to_encode:
    df[col] = label_encoders[col].fit_transform(df[col])

# Display the transformed DataFrame

In [28]:
df.head()

,rownames,nr,year,school,exper,union,ethn,maried,health,wage,industry,occupation,residence
0,1,13,1980,14,1,0,2,0,0,1.197540,1,8,north_east
1,2,13,1981,14,2,1,2,0,0,1.853060,7,8,north_east
2,3,13,1982,14,3,0,2,0,0,1.344462,1,8,north_east
3,4,13,1983,14,4,0,2,0,0,1.433213,1,8,north_east
4,5,13,1984,14,5,0,2,0,0,1.568125,7,1,north_east

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4360 entries, 0 to 4359
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rownames    4360 non-null   int64
 1   nr          4360 non-null   int64
 2   year        4360 non-null   int64
 3   school      4360 non-null   int64
 4   exper       4360 non-null   int64
 5   union       4360 non-null   int32
 6   ethn        4360 non-null   int32
 7   maried      4360 non-null   int32
 8   health      4360 non-null   int32
 9   wage        4360 non-null   float64
 10  industry    4360 non-null   int32
 11  occupation  4360 non-null   int32
 12  residence   3115 non-null   object
dtypes: float64(1), int32(6), int64(5), object(1)
memory usage: 340.8+ KB